package Level_2;

/**
 * Title - Необъективная реальность # 0210.
 * @task Напиши программу, которая выводит на экран надпись: "Будешь плохо кодить, придет Java и съест твою память".
 *
 * Требования:
 * •	Программа должна выводить текст на экран.
 * •	Текст должен начинаться с "Будешь".
 * •	Текст должен заканчиваться на "память".
 * •	Текст должен состоять из 52 символов, включая пробелы и знаки препинания.
 * •	Выводимый текст должен соответствовать заданию.
 */

public class Task_0210 {
    public static void main(String[] args) {
        System.out.println("Будешь плохо кодить, придет Java и съест твою память");
    }
}
