package Level_2;

/**
 * Title - Одного кота нам мало # 0208.
 * @task Создать объект типа Cat 2 раза.
 * Сохрани каждый экземпляр в свою переменную.
 * Имена переменных должны быть разные.
 *
 * Требования:
 * •	Программа не должна выводить текст на экран.
 * •	В методе main должно быть только две переменные типа Cat.
 * •	Переменным сразу должны быть присвоены значения.
 * •	В классе Cat не должно быть переменных.
 * •	В классе Cat не должно быть методов.
 */

public class Task_0208 {
    public static void main(String[] args) {
        Cat cat1 = new Cat();
        Cat cat2 = new Cat();
    }

    public static class Cat {

    }
}
