package Level_1;

/**
 * Title - Одной переменной недостаточно # 0111
 * @task Объяви переменные a, b типа int и переменную s типа String.
 * Сразу же в строке объявления присвой им любые разные значения.
 *
 * Требования:
 * •	Объяви две переменные типа int.
 * •	Объяви одну переменную типа String.
 * •	Имена переменных типа int должны быть a и b.
 * •	Имя переменной типа String должно быть s.
 * •	Переменным сразу должны быть присвоены значения.
 */

public class Task_0111 {
    public static void main(String[] args) {
        int a = 5;
        int b = 10;
        String s = "str";
    }
}
