package Level_1;

/**
 * Title - Мне снова 15(!) # 0119
 * @task Внеси изменения в программу, чтобы переменная age имела значение 15.
 *
 * Требования:
 * •	Должно быть объявлено 4 переменных.
 * •	Тип переменной age должен быть int.
 * •	Всем переменным должны присваиваться значение сразу после создания.
 * •	Значение, которое присваивается переменной age, должно быть равно 15.
 */

public class Task_0119 {
    public static void main(String[] args) {
        String name = "Amigo";
        int age = 15;
        int money = 500;
        int weight = 70;
    }
}
