package Level_1;

/**
 * Title - «Я по объявлению…» # 0109
 * @task Объяви переменные a, b типа int.
 * Сразу же в строке объявления присвой им разные значения.
 * Значениями могут быть любые целые числа.
 *
 * Требования:
 * •	Объяви две переменные типа int.
 * •	Имена переменных должны быть a и b.
 * •	Переменным сразу должны быть присвоены значения.
 * •	Переменные a и b должны иметь разные значения.
 */

public class Task_0109 {
    public static void main(String[] args) {
        int a = 5;
        int b = 10;
    }
}
