package Level_1;

/**
 * Title - Подойдет только 20 # 0137
 * @task В методе main расставь правильно знаки плюс и минус, чтобы значение переменной result получилось равным 20.
 * Знаки нужно расставить только в строчке, в которой объявляется переменная result.
 * Порядок следования переменных в этой строке изменять нельзя.
 * Перед каждой переменной должен стоять знак либо плюс, либо минус.
 *
 * Требования:
 * •	Значения переменных: a, b, c, d не изменяй.
 * •	Перед каждой из переменных: a, b, c, d в строке с объявлением переменной result должен стоять один знак плюс либо минус.
 * •	В результате работы программы на экран нужно вывести число 20.
 * •	Знаки плюс и минус должны быть расставлены правильно.
 */

public class Task_0137 {
    public static int a = 1;
    public static int b = 3;
    public static int c = 9;
    public static int d = 27;

    public static void main(String[] args) {

        int result = -a + b - c + d;

        System.out.println(result);
    }
}
