package Level_1;

/**
 * Title - Лишние строки нам не нужны # 0123
 * @task Закомментируй те переменные, которые нигде не используются. Программа должна компилироваться.
 *
 * Требования:
 * •	Тип переменных менять нельзя.
 * •	Значения переменных менять нельзя.
 * •	В программу нельзя добавлять новые строки или удалять имеющиеся.
 * •	Нужно закомментировать неиспользуемые переменные.
 * •	Вывод программы не должен измениться.
 */

public class Task_0123 {
    public static void main(String[] args) {
        int a = 10;
        int b = 15;
        double c = b + 38;
        int d = a + 12;
    //    double e = 12.3;
        String s = "s" + a;
        String s1 = a + "b";
    //    String s2 = "a";
        String s3 = s1 + "a";
        String s4 = s3 + "b";
        System.out.println(c + s4 + s);
    }
}
