package Level_1;

/**
 * Title - Поиск ошибок # 0122
 * @task Исправь ошибку в программе. Нужно чтобы программа выводила на экран число 100.
 *
 * Требования:
 * •	Программа должна выводить на экран текст.
 * •	Должно быть объявлено 3 переменные.
 * •	Тип переменных менять нельзя.
 * •	Значения переменных менять нельзя.
 * •	В программу нельзя добавлять новые строки или удалять имеющиеся.
 * •	Внеси минимальные изменения в команду вывода.
 * •	Выведенный текст должен соответствовать заданию.
 */

public class Task_0122 {
    public static void main(String[] args) {
        int a = 56;
        int b = 30;
        int c = 14;
        System.out.print(a + b + c);
    }
}
