package Level_1;

/**
 * Title - Большая чистка # 0125
 * @task Объяви недостающие переменные и закомментируй те, которые нигде не используются.
 *
 * Требования:
 * •	Программа должна выводить на экран текст.
 * •	Должно быть объявлено 4 переменные.
 * •	Нужно закомментировать неиспользуемые переменные.
 * •	Вывод программы не должен измениться.
 */

public class Task_0125 {
    public static void main(String[] args) {
    //    String s = "15";
        int a = 5;
    //    int z = 18;
        int d = 18;
        int c = a + d;
        String b = " is better than ";

        System.out.println(a + b + c);
    }
}
