package Level_1;

/**
 * Title - Еще немного исправлений # 0117
 * @task Внеси изменения в программу, чтобы выводился на экран текст:
 * Coding in java
 * Используй переменные.
 *
 * Требования:
 * •	Должно быть объявлено 3 переменных.
 * •	Всем переменным должны быть присвоены значение сразу после создания.
 * •	Команду вывода текста на экран изменять нельзя.
 * •	Программа должна выводить текст "Coding in java".
 */

public class Task_0117 {
    public static void main(String[] args) {
        String s1 = "Coding";
        String s2 = "in";
        String s3 = "java";
        System.out.println(s1 + " " + s2 + " " + s3);
    }
}
