package Level_1;

/**
 * Title - Лучше поздно, чем никогда: Hello world! # 0139
 * @task - Амиго, ты хочешь стать программистом?
 * - Ещё бы!
 * - Тогда быстрее пиши программу, которая выводит на экран фразу "Hello World!".
 * - Но… Это как-то банально!
 * - Именно. Амиго, твои мысли совпадают с моими, и это – отлично. Поэтому лучше выведи фразу, которую нам,
 *   роботам, стоит повторять в моменты неуверенности. Вот она: "Поцелуй мой блестящий металлический зад!"
 *
 * Требования:
 * •	Программа должна выводить текст.
 * •	Текст должен начинаться с "Поцелуй".
 * •	Текст должен заканчиваться знаком восклицания.
 * •	Текст должен состоять из 40 символов, включая пробелы и знак восклицания.
 * •	Выводимый текст должен соответствовать заданию.
 */

public class Task_0139 {
    public static void main(String[] args) {
        System.out.println("Поцелуй мой блестящий металлический зад!");
    }
}
