package Level_1;

/**
 * Title - Любимое стихотворение # 0138
 * @task В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
 * В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки "Мое любимое стихотворение:".
 *
 * Требования:
 * •	Программа должна выводить текст.
 * •	Перед стихом должна быть выведена строка "Мое любимое стихотворение:".
 * •	Выводимый текст должен состоять не меньше, чем из пяти строк (пустые строки - это тоже строки).
 * •	В выводимом тексте должно быть не менее, чем 50 символов.
 */

public class Task_0138 {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        System.out.println("Тихий ветер. Вечер сине-хмурый.");
        System.out.println("Я смотрю широкими глазами.");
        System.out.println("В Персии такие ж точно куры");
        System.out.println("Как у нас в соломенной Рязани.");
    }
}
