package Level_1;

/**
 * Title - Выбирай здоровую еду! Выбирай фрукты! # 0135
 * @task Выведи на экран переменные, значения которых являются названиями фруктов.
 * Каждую переменную выведи с новой строки.
 *
 * Требования:
 * •	Программа должна выводить текст.
 * •	Нельзя изменять строки с объявлением переменных.
 * •	Выводимый текст должен состоять из 2 строк.
 * •	Программа должна выводить переменные, значения которых являются названиями фруктов.
 * •	Программа не должна выводить переменные, значения которых не являются названиями фруктов.
 */

public class Task_0135 {
    public static void main(String[] args) {
        String apple = "Яблоко";
        String porridge = "Каша";
        String sausage = "Колбаса";
        String peach = "Персик";
        System.out.println(apple);
        System.out.println(peach);
    }
}
