package Level_1;

/**
 * Title - На нашем экране — переменная # 0110
 * @task Объяви переменную name типа String.
 * Сразу же в строке объявления присвой ей какое-нибудь значение.
 * Выведи на экран переменную name.
 *
 * Требования:
 * •	В методе main объяви переменную типа String.
 * •	Имя переменной должно быть name.
 * •	Переменной сразу должно быть присвоено значение.
 * •	Программа должна выводить текст на экран.
 * •	Выведенный текст должен быть значением переменной.
 */

public class Task_0110 {
    public static void main(String[] args) {
        String name = "Vasja";
        System.out.println(name);
    }
}
