package Level_3;

/**
 * Title - Не думать о секундах… # 0133.
 * @task Напиши код, который считает сколько секунд прошло с 15:00, если на часах 15:30. Выведи результат на экран.
 *
 * Требования:
 * •	Программа должна выводить текст.
 * •	Выведенный текст должен быть целым положительным числом.
 * •	Выведенное число должно быть кратно 60.
 * •	Выводимое число должно соответствовать заданию.
 */

public class Task_0133 {
    public static void main(String[] args) {
        int secondsAfter15 = 30 * 60;
        System.out.println(secondsAfter15);
    }
}
