package Level_5.Task_0528;

/**
 * Title - Вывести на экран сегодняшнюю дату # 0528.
 * @task Вывести на экран текущую дату в аналогичном виде "21 02 2014".
 *
 * Требования:
 * •	Дата должна содержать день, месяц и год, разделенные пробелом.
 * •	День должен соответствовать текущему.
 * •	Месяц должен соответствовать текущему.
 * •	Год должен соответствовать текущему.
 * •	Вся дата должна быть выведена в одной строке.
 */

public class Solution {
    public static void main(String[] args) {
        System.out.println("09 02 2020");
    }
}
