package Level_0;

/**
 * Title - Я думаю, быть программистом - это круто.
 * # 0101
 * @task Напиши программу, которая выводит на экран надпись:
 *
 * Я думаю, быть программистом - это круто
 *
 * Требования:
 * •	Программа должна выводить текст.
 * •	Текст должен начинаться с "Я думаю".
 * •	Текст должен заканчиваться на "это круто".
 * •	Текст должен состоять из 39 символов, включая пробелы и знаки препинания.
 * •	Текст должен состоять из одной строки.
 * •	Выводимый текст должен соответствовать заданию
 */

public class Task_0101 {
    public static void main(String[] args) {
        System.out.println("Я думаю, быть программистом - это круто");
    }
}
