package Level_0;

/**
 * Title - Баги и фичи # 0106
 * @task Напиши программу, которая выводит на экран надпись:
 *
 * Это не баг, это фича.
 *
 * Требования:
 * •	Программа должна выводить текст.
 * •	Текст должен начинаться с "Это не баг".
 * •	Текст должен заканчиваться точкой.
 * •	Текст должен состоять из 21 символа, включая пробелы и знаки препинания.
 * •	Выводимый текст должен соответствовать заданию.
 */

public class Task_0106 {
    public static void main(String[] args) {
        System.out.println("Это не баг, это фича.");
    }
}
