package Level_0;

/**
 * Title - Мой юный друг.
 * # 0103
 * @task Сейчас 3126 год. Мой друг родился 8 лет назад.
 * Написать программу, выводящую на экран год рождения моего друга.
 *
 * Требования:
 * •	Программа должна выводить текст.
 * •	Выведенный год должен состоять из 4 цифр.
 * •	Выведенный год должен начинаться с "31".
 * •	Выведенный год должен соответствовать заданию.
 */

public class Task_0103 {
    public static void main(String[] args) {
        System.out.println(3126 - 8);
    }
}
