package Level_0;

/**
 * Title - Комплимент учителю.
 * # 0102
 * @task Написать программу, выводящую на экран надпись "Элли самая красивая" 5 раз. Каждый раз - с новой строки.
 *
 * Пример вывода на экран:
 * Элли самая красивая
 * Элли самая красивая
 * Элли самая красивая
 * Элли самая красивая
 * Элли самая красивая
 *
 * Требования:
 * •	Программа должна выводить текст.
 * •	Текст должен начинаться с "Элли".
 * •	Текст должен заканчиваться на "красивая".
 * •	Текст должен состоять из 5 строк.
 * •	Выводимый текст должен соответствовать заданию.
 */

public class Task_0102 {
    public static void main(String[] args) {
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
        System.out.println("Элли самая красивая");
    }

}
