package Level_0;

/**
 * Title - Амиго очень умный.
 * # 0142
 * @task Напиши программу, которая выводит на экран надпись: "Амиго очень умный".
 * Требования:
 * •	Программа должна выводить текст.
 * •	Текст должен начинаться с "Амиго".
 * •	Текст должен заканчиваться на "умный".
 * •	Текст должен состоять из 17 символов, включая пробелы.
 * •	Выводимый текст должен соответствовать заданию.
 */

public class Task_0142 {
    public static void main(String[] args) {
        System.out.println("Амиго очень умный");
    }
}
