package Level_4.Task_0430;

/**
 * Title - От 1 до 10 # 0430.
 * @task Вывести на экран числа от 1 до 10 используя цикл while. Каждое значение с новой строки.
 *
 * Требования:
 * •	Программа не должна считывать числа c клавиатуры.
 * •	Программа должна выводить числа на экран.
 * •	Каждое значение должно быть выведено с новой строки.
 * •	Программа должна выводить числа от 1 до 10.
 * •	В программе должен использоваться цикл while.
 */

public class Solution {
    public static void main(String[] args) {
        int i = 1;

        while (i < 11) {
            System.out.println(i);
            i++;
        }
    }
}
