package Level_4.Task_0440;

/**
 * Title Достойная оплата труда # 0440.
 * @task Используя цикл вывести на экран сто раз надпись:
 * "Я никогда не буду работать за копейки. Амиго"
 * Каждое значение вывести с новой строки.
 *
 * Требования:
 * •	Программа не должна считывать текст c клавиатуры.
 * •	Программа должна выводить текст на экран.
 * •	Программа должна выводить 100 раз текст указанный в задании.
 * •	В программе должен использоваться цикл for или цикл while.
 */

public class Solution {
    public static void main(String[] args) {
        for (int i = 1; i < 101; i++ ) {
            System.out.println("Я никогда не буду работать за копейки. Амиго");
        }
    }
}
